[
    {
        "term": "Joint between adjacent vertebrae",
        "definition": "A cartilaginous joint known as an intervertebral disc, allowing slight movement and acting as a cushion."
    },
    {
        "term": "The source of oxygen and nutrients for articular cartilage",
        "definition": "Synovial fluid provides oxygen and nutrients to articular cartilage, as cartilage lacks its own blood supply."
    },
    {
        "term": "Reinforces a joint capsule",
        "definition": "Ligaments and muscles surrounding a joint provide reinforcement and stability to the joint capsule."
    },
    {
        "term": "Coracohumeral ligament",
        "definition": "A ligament in the shoulder joint that helps stabilize and support the joint, connecting the coracoid process to the humerus."
    },
    {
        "term": "Largest and most complex synovial joint",
        "definition": "The knee joint, which allows complex movement and is stabilized by various ligaments and cartilage."
    },
    {
        "term": "Radial collateral ligament",
        "definition": "A ligament located in the elbow that stabilizes the lateral side of the joint."
    },
    {
        "term": "A function of muscles",
        "definition": "Muscles generate movement, maintain posture, stabilize joints, and produce heat."
    },
    {
        "term": "The striated appearance",
        "definition": "Characteristic banded pattern of skeletal and cardiac muscle due to the alignment of sarcomeres."
    },
    {
        "term": "An aponeurosis is",
        "definition": "A flat, broad tendon that connects muscles to the parts they move or stabilize."
    },
    {
        "term": "Skeletal muscle cells compared to smooth muscle cells",
        "definition": "Skeletal muscle cells are striated, multinucleated, and voluntary, while smooth muscle cells are non-striated, uninucleated, and involuntary."
    },
    {
        "term": "Muscle fiber",
        "definition": "A single muscle cell, which is long, cylindrical, and multinucleated in skeletal muscle."
    },
    {
        "term": "Cross-bridges",
        "definition": "Connections formed between actin and myosin filaments during muscle contraction, allowing force generation."
    },
    {
        "term": "Motor end plate",
        "definition": "The region of a muscle fiber membrane where it interfaces with a motor neuron, containing receptors for neurotransmitters."
    },
    {
        "term": "Muscle fiber contraction",
        "definition": "The process where muscle fibers shorten in response to stimuli, due to actin and myosin filament interaction."
    },
    {
        "term": "Recruitment",
        "definition": "The process of activating additional motor units to increase the force of muscle contraction."
    },
    {
        "term": "Latent period",
        "definition": "The brief time between the application of a stimulus and the beginning of muscle contraction."
    },
    {
        "term": "Fused tetany",
        "definition": "A sustained muscle contraction without relaxation, resulting from continuous, rapid stimuli."
    },
    {
        "term": "Partial tetany",
        "definition": "A state of sustained muscle contraction with brief relaxation periods, occurring with less frequent stimuli."
    },
    {
        "term": "A function of the nervous system",
        "definition": "The nervous system is responsible for sensory input, integration, and motor output."
    },
    {
        "term": "Unipolar neurons",
        "definition": "Neurons with a single process that branches into two, primarily involved in sensory functions."
    },
    {
        "term": "The function of sensory receptors",
        "definition": "Sensory receptors detect changes in the environment and relay information to the nervous system."
    },
    {
        "term": "Guillain-Barre syndrome",
        "definition": "An autoimmune disorder where the body's immune system attacks the peripheral nerves, causing muscle weakness and paralysis."
    },
    {
        "term": "Bipolar neurons",
        "definition": "Neurons with one axon and one dendrite, commonly found in sensory systems such as vision and smell."
    },
    {
        "term": "Multipolar neurons",
        "definition": "Neurons with one axon and multiple dendrites, the most common neuron type in the central nervous system."
    },
    {
        "term": "Presynaptic neurons release neurotransmitters",
        "definition": "Neurotransmitters are released by presynaptic neurons at synaptic terminals to communicate with postsynaptic cells."
    },
    {
        "term": "Voltage-gated Na+ channels open",
        "definition": "A key event in action potential initiation, allowing sodium ions to enter the neuron and depolarize the membrane."
    },
    {
        "term": "Thick and myelinated",
        "definition": "Axons that are covered in a myelin sheath, facilitating faster transmission of electrical impulses."
    },
    {
        "term": "Thin and unmyelinated",
        "definition": "Axons that lack a myelin sheath, resulting in slower electrical impulse conduction."
    },
    {
        "term": "Repolarized",
        "definition": "The process of returning a depolarized cell membrane back to its resting potential."
    },
    {
        "term": "The correct sequence of events that occurs along an axon after the membrane reaches threshold",
        "definition": "1) Depolarization, 2) Action potential propagation, 3) Repolarization, and 4) Return to resting state."
    },
    {
        "term": "Modified amino acids",
        "definition": "Neurotransmitters derived from amino acids, such as dopamine and serotonin."
    },
    {
        "term": "Reuptake",
        "definition": "The process by which neurotransmitters are absorbed back into the presynaptic neuron after transmission."
    },
    {
        "term": "Decreases the membrane permeability of nerve fibers to sodium",
        "definition": "A mechanism by which nerve excitability is reduced, often through drugs or anesthetics that block sodium channels."
    },
    {
        "term": "Neurotransmitter is most likely released when a person uses a drug that creates a sense of well-being",
        "definition": "Dopamine is commonly released, associated with pleasure and reward sensations."
    }
]
